import React from 'react'

const Question = () => {
	return (
		<div>
			<p>
				Утечка памяти (Memory Leak) в программировании означает ситуацию, когда
				программное приложение неправильно использует память, не освобождая уже
				не нужные объекты или ресурсы. По мере выполнения приложения, занимаемая
				память продолжает увеличиваться, что может привести к исчерпанию
				доступной памяти и ухудшению производительности программы или даже к
				падению приложения из-за нехватки ресурсов.
			</p>
		</div>
	)
}

export default Question
