import React from 'react'

const Question_1 = () => {
	return (
		<div>
			<p>
				<ul>
					<li>
						<b>&lt;sub&gt; </b>представляет подстрочный текст. Текст,
						заключенный в тэг <b>&lt;sub&gt;</b>, отображается ниже базовой
						линии и немного уменьшен в размере шрифта. Это обычно используется
						для математических формул, химических уравнений, сносок и подобного.
					</li>
					<li>
						<b>&lt;sup&gt; </b>представляет надстрочный текст. Текст,
						заключенный в тэг <b>&lt;sup&gt;</b>, отображается выше базовой
						линии и немного уменьшен в размере шрифта. Обычно используется для
						экспонентов, степеней, сносок, а также в некоторых случаях для
						указания торговых марок и сокращений.
					</li>
				</ul>
			</p>
		</div>
	)
}

export default Question_1
