import React from 'react'

const Question = () => {
	return (
		<div>
			<p>
				Создание и поддержание единого стиля CSS на больших проектах требует
				системного и структурированного подхода. Вот несколько bewbcbd для
				обеспечения согласованности стилей:
			</p>
			<p>
				<ul>
					<li>
						<b>Методологии: </b>Используйте BEM, OOCSS для структурирования
						кода.
					</li>
					<li>
						<b>CSS Препроцессоры: </b>Sass, Less для удобства и поддержки.
					</li>
					<li>
						<b>Нормализация: </b>Используйте Normalize.css для единообразия в
						браузерах.
					</li>
					<li>
						<b>Правила Именования: </b>Поддерживайте однородные имена классов.
					</li>
					<li>
						<b>Цвет и Шрифты: </b>Определите общую цветовую палитру и шрифты.
					</li>
				</ul>
			</p>
		</div>
	)
}

export default Question
