import React from 'react'

const Question = () => {
	return (
		<div>
			<p>
				TypeScript - это язык программирования, который представляет собой
				надстройку над JavaScript, добавляющую статическую типизацию к
				синтаксису JavaScript. Он разработан и поддерживается компанией
				Microsoft. TypeScript позволяет создавать более надежные и понятные
				программы, добавляя возможность определения типов данных к переменным,
				параметрам функций, объектам и другим элементам кода.
			</p>
			<p>
				Одной из ключевых особенностей TypeScript является возможность
				объявления типов данных, что упрощает обнаружение ошибок на этапе
				разработки, таких как неправильное использование переменных или
				некорректные операции над разными типами данных.
			</p>
			<p>
				Также TypeScript компилируется в обычный JavaScript, что позволяет
				использовать его везде, где может использоваться JavaScript. TypeScript
				является открытым исходным кодом и имеет активное сообщество
				разработчиков, что способствует его развитию и появлению новых функций.
			</p>
		</div>
	)
}

export default Question
