import React from 'react'

const Question_1 = () => {
	return (
		<div>
			<p>
				Мета-теги (или мета-элементы) являются элементами HTML, предназначенными
				для предоставления информации о веб-странице. Они не отображаются
				напрямую на странице, а используются для передачи метаданных - данных о
				данных - о содержимом страницы.
			</p>
			<p>
				Эти теги обычно находятся внутри секции &lt;head&gt; HTML-документа и
				играют важную роль для поисковых систем, социальных сетей, браузеров и
				других инструментов, обрабатывающих страницы в интернете.
			</p>
		</div>
	)
}

export default Question_1
