import React from 'react'

const Question = () => {
	return (
		<div>
			<p>
				Псевдоэлементы в CSS - это части элемента, которые можно стилизовать, но
				которых нет в исходном HTML-коде. Они представляют собой дополнительные
				элементы, создаваемые с помощью CSS, и обозначаются с помощью двойного
				двоеточия (::). Псевдоэлементы используются для создания эффектов,
				которые не могут быть достигнуты только с помощью стандартных
				селекторов.
			</p>
		</div>
	)
}

export default Question
