import React from 'react'

const Question_1 = () => {
	return (
		<div>
			<p>
				Семантика в веб-разработке относится к использованию элементов HTML для
				выражения смысла содержимого веб-страницы. Это означает использование
				элементов не только для определения визуального представления контента,
				но и для точного определения его значения и назначения. Семантические
				теги помогают поисковым системам, ассистентам, а также разработчикам
				исходного кода лучше понимать структуру страницы, делая её более
				доступной и понятной.
			</p>
			<p>Примеры: header, nav, main, article, section, aside, footer</p>
		</div>
	)
}

export default Question_1
