import React from 'react'

const Question_1 = () => {
	return (
		<div>
			<p>
				Тег <b>samp</b> в HTML используется для обозначения текста, который
				представляет собой вывод отдельной программы или скрипта. Это сокращение
				означает "sample output" (образец вывода). Он обычно используется для
				демонстрации вывода программы, командной строки, скриптов или других
				подобных результатов.
			</p>
			<p>
				Хотя тег <b>samp</b> является одним из официальных элементов HTML,
				стилизация его содержимого может отличаться в зависимости от браузера, и
				он обычно отображается в браузерах как моноширинный текст (как обычно
				выводится текст в командной строке).
			</p>
		</div>
	)
}

export default Question_1
