import React from 'react'

const Question = () => {
	return (
		<div>
			<p>
				React — это библиотека JavaScript с открытым кодом для создания внешних
				пользовательских интерфейсов. В отличие от других библиотек JavaScript,
				предоставляющих полноценную платформу приложений, React ориентируется
				исключительно на создание представлений приложений через
				инкапсулированные единицы (называются компонентами), которые сохраняют
				состояние и генерируют элементы пользовательского интерфейса.
			</p>
		</div>
	)
}

export default Question
