import React from 'react'

const Question_1 = () => {
	return (
		<div>
			<p>
				<b>srcset</b> - это атрибут HTML, который используется вместе с
				элементами изображений, такими как <b>&lt;img&gt;</b> или{' '}
				<b>&lt;source&gt;</b>. Он определяет набор изображений разного размера
				или разного разрешения для того, чтобы браузер мог выбрать наиболее
				подходящее изображение на основе устройства пользователя, его разрешения
				экрана и других факторов.
			</p>
			<p>
				Этот атрибут предоставляет браузеру список альтернативных изображений с
				разным разрешением, чтобы оптимизировать загрузку и отображение
				изображений в зависимости от контекста.
			</p>
		</div>
	)
}

export default Question_1
