import React from 'react'

const Question = () => {
	return (
		<div>
			<p>
				Работа с мультимедийным контентом, таким как аудио и видео, включает в
				себя определенные рекомендации и практики для обеспечения лучшей
				доступности для всех пользователей, включая тех, у которых есть
				ограниченные возможности. Вот несколько рекомендаций:
			</p>
			<p>
				<ol>
					<li>
						<b>Субтитры и транскрипты: </b> Для видео с диалоговым контентом
						предоставьте субтитры (закрытые или открытые) или транскрипты. Это
						поможет пользователям с проблемами слуха и тем, кто не может
						включать звук, понимать контент.
					</li>
					<li>
						<b>Описание аудио и видео: </b> Предоставьте описания для аудио и
						видео, которые содержат важную информацию, которая не воспринимается
						через слух. Это важно для пользователей с ограниченной слуховой
						способностью.
					</li>
					<li>
						<b>Альтернативные тексты для видео-кадров и изображений: </b> Если
						видео содержит важные визуальные элементы, удостоверьтесь, что
						каждый видео-кадр имеет соответствующий альтернативный текст,
						который описывает содержание кадра. Это помогает пользователям,
						которые не могут видеть видео, понимать его с помощью скринридеров.
					</li>
					<li>
						<b>Постоянная доступность: </b> Убедитесь, что мультимедийный
						контент и связанные с ним данные (субтитры, альтернативные тексты)
						остаются доступными с течением времени. Если вы используете
						сторонние сервисы для размещения видео, убедитесь, что они также
						поддерживают доступность.
					</li>
					<li>
						<b>Клавиатурная навигация: </b> Обеспечьте, чтобы пользователи могли
						управлять мультимедийным контентом с клавиатуры. Возможность
						перемещаться по элементам управления с помощью клавиш Tab и Enter
						важна для пользователей с ограниченной мобильностью или зрением.
					</li>
					<li>
						<b>Отсутствие автоматического воспроизведения: </b> Избегайте
						автоматического воспроизведения аудио и видео, так как это может
						отвлекать и беспокоить пользователей, а также создавать проблемы для
						тех, у кого есть проблемы с фокусировкой внимания.
					</li>
					<li>
						<b>Пользовательская настройка: </b>Предоставьте пользователям
						возможность настройки мультимедийного контента, таких как
						регулировка громкости, управление субтитрами и выбор доступных
						альтернативных текстов.
					</li>
					<li>
						<b>Обучение и осведомленность: </b> Обучите вашу команду о принципах
						доступности мультимедиа-контента и о том, как их правильно
						реализовать.
					</li>
				</ol>
			</p>
		</div>
	)
}

export default Question
