import React from 'react'

const Question = () => {
	return (
		<div>
			<p>
				WCAG (Web Content Accessibility Guidelines) - это набор стандартов и
				рекомендаций, разработанных консорциумом W3C (World Wide Web
				Consortium), предназначенных для обеспечения доступности веб-содержания
				для людей с различными ограничениями и инвалидностями. WCAG определяет
				принципы, рекомендации и проверочные критерии, которые помогают
				разработчикам создавать веб-сайты и веб-приложения, которые могут быть
				использованы всеми, включая людей с ограниченными возможностями, такими
				как слепые или слабовидящие, глухие или слабослышащие, а также люди с
				моторными ограничениями и другими ограничениями.
			</p>
		</div>
	)
}

export default Question
