import React from 'react'

const Question = () => {
	return (
		<div>
			<p>
				ECMAScript (ES) - это стандарт языка программирования, который
				определяет основные функции и синтаксис для языка JavaScript. JavaScript
				является реализацией этого стандарта и является одним из наиболее
				популярных и широко используемых языков программирования для создания
				интерактивных веб-сайтов и веб-приложений.
			</p>
			<p>
				Отличие между ECMAScript и JavaScript заключается в том, что ECMAScript
				- это стандарт, описывающий язык, в то время как JavaScript - это
				конкретная реализация этого стандарта, которая была создана Netscape и
				впоследствии стала основой для многих других браузеров.
			</p>
			<p>
				Каждая версия JavaScript соответствует определенной версии ECMAScript.
				Например, JavaScript ES5 соответствует стандарту ECMAScript 5,
				JavaScript ES6 (или ECMAScript 2015) соответствует стандарту ECMAScript
				2015 и так далее. Новые версии ECMAScript обычно включают в себя новые
				возможности и улучшения языка, которые могут быть использованы
				разработчиками для создания более мощных и эффективных веб-приложений.
			</p>
			<p>
				Таким образом, JavaScript является реализацией ECMAScript и используется
				для создания динамических веб-сайтов, в то время как ECMAScript - это
				стандарт, который определяет синтаксис и функциональность этого языка
				программирования.
			</p>
		</div>
	)
}

export default Question
