import React from 'react'

const Question_1 = () => {
	return (
		<div>
			<p>
				Элемент <b>&lt;picture&gt;</b> в HTML используется для предоставления
				нескольких источников изображений и различных версий изображений, чтобы
				браузер мог выбрать наиболее подходящий источник в зависимости от
				различных условий, таких как разрешение экрана, размеры отображения, тип
				устройства и другие факторы.
			</p>
			<p>
				Это особенно полезно в случаях, когда нужно предоставить различные
				версии изображений для разных устройств, чтобы обеспечить оптимальное
				качество и производительность.
			</p>
		</div>
	)
}

export default Question_1
