import React from 'react'

const Question = () => {
	return (
		<div>
			<p>
				Usability (применяемость) и accessibility (доступность) - это два важных
				аспекта веб-дизайна и разработки, но они имеют разные цели и фокус. Вот
				ключевые различия между ними:
			</p>
			<p>
				<ol>
					<li>
						<b>Цель:</b>
						<ul>
							<li>
								<b>Usability (применяемость): </b>Основная цель usability - это
								обеспечить удовлетворительный и эффективный пользовательский
								опыт. Это означает, что веб-сайт или приложение легко
								использовать, интуитивно понимать и удовлетворять потребности
								пользователей.
							</li>
							<li>
								<b>Accessibility (доступность): </b>Основная цель accessibility
								- это обеспечить доступность веб-сайтов и приложений для всех
								пользователей, включая тех, у которых есть ограниченные
								возможности. Это означает, что контент и функциональность должны
								быть доступными для всех, независимо от их способностей или
								ограничений.
							</li>
						</ul>
					</li>
					<li>
						<b>Пользовательская аудитория:</b>
						<ul>
							<li>
								<b>Usability (применяемость): </b>Процесс usability-тестирования
								обычно оценивает опыт "среднего" пользователя без особых
								ограничений, исходя из ожидаемых пользовательских потребностей и
								целей.
							</li>
							<li>
								<b>Accessibility (доступность): </b>Accessibility фокусируется
								на разработке и тестировании для пользователей с различными
								ограничениями, такими как слепота, низкое зрение, низкая
								слуховая способность и ограниченная мобильность. Это также может
								включать временные ограничения, такие как временная
								инвалидность.
							</li>
						</ul>
					</li>
					<li>
						<b>Аспекты дизайна:</b>
						<ul>
							<li>
								<b>Usability (применяемость): </b>Процесс usability включает в
								себя анализ пользовательской навигации, удовлетворения
								потребностей пользователей и улучшение пользовательского опыта,
								включая интерфейс и визуальное оформление.
							</li>
							<li>
								<b>Accessibility (доступность): </b>Accessibility фокусируется
								на обеспечении доступности для всех пользователей путем
								устранения барьеров, таких как использование альтернативных
								текстов для изображений, клавиатурной навигации и других
								технических аспектов.
							</li>
						</ul>
					</li>
					<li>
						<b>Методы тестирования:</b>
						<ul>
							<li>
								<b>Usability (применяемость): </b> Usability-тестирование может
								включать в себя тестирование пользователей с заданиями и
								опросами, чтобы оценить их опыт использования веб-сайта или
								приложения.
							</li>
							<li>
								<b>Accessibility (доступность): </b>Accessibility-тестирование
								включает в себя проверку соответствия веб-сайта или приложения
								стандартам доступности, а также тестирование с использованием
								вспомогательных технологий, таких как скринридеры.
							</li>
						</ul>
					</li>
				</ol>
			</p>
			<p>
				Хотя usability и accessibility имеют разные фокусы, они взаимосвязаны и
				важны для обеспечения успешного веб-присутствия. Удовлетворительный
				пользовательский опыт и доступность для всех пользователей, включая тех,
				у которых есть ограниченные возможности, являются важными целями для
				разработчиков и дизайнеров веб-сайтов и приложений.
			</p>
		</div>
	)
}

export default Question
