import React from 'react'

const Question_1 = () => {
	return (
		<div>
			<p>
				Разница между ними в том, что &lt;strong&gt; и &lt;em&gt; придают тексту
				и семантическое значение, и визуальное оформление, тогда как &lt;b&gt; и
				&lt;i&gt; просто придают визуальное оформление без добавления семантики.
				В современной веб-разработке рекомендуется использовать &lt;strong&gt; и
				&lt;em&gt; для выделения текста с семантическим значением, а не только
				&lt;b&gt; и &lt;i&gt;, чтобы помочь ассистивным технологиям и поисковым
				системам лучше понимать содержимое страницы.
			</p>
		</div>
	)
}

export default Question_1
