import React from 'react'

const Question_1 = () => {
	return (
		<div>
			<p>
				Использование семантических тегов в HTML имеет несколько важных
				преимуществ:
			</p>
			<p>
				<ol>
					<li>
						<b>Ясность кода и понимание контента: </b>Семантические теги
						предоставляют информацию о значении содержимого, что делает код
						более понятным как для разработчиков, так и для автоматизированных
						инструментов (например, поисковых систем). Они явно указывают на
						типы данных на странице, делая их структуру легко читаемой.
					</li>
					<li>
						<b>Улучшение доступности: </b>Правильное использование семантических
						тегов помогает создать более доступные веб-сайты. Это помогает людям
						с ограничениями (например, использующим скринридеры) лучше понимать
						структуру страницы.
					</li>
					<li>
						<b>SEO (поисковая оптимизация): </b>Поисковые системы, такие как
						Google, Bing и другие, лучше понимают содержимое веб-страниц, когда
						оно организовано с использованием семантических тегов. Это может
						помочь в улучшении рейтинга поисковой выдачи.
					</li>
					<li>
						<b>Поддержка различных устройств: </b>Семантические теги
						способствуют лучшему отображению веб-страниц на различных
						устройствах, так как они помогают браузерам лучше интерпретировать и
						структурировать содержимое.
					</li>
					<li>
						<b>Совместимость с будущими технологиями: </b> Использование
						семантических тегов способствует гибкости и универсальности вашего
						кода, что делает его более готовым к будущим технологическим
						изменениям и развитию языка HTML.
					</li>
				</ol>
			</p>
		</div>
	)
}

export default Question_1
