import React from 'react'

const Question = () => {
	return (
		<div>
			<p>
				В JavaScript существует несколько типов операторов, которые выполняют
				различные операции над операндами (значениями, переменными, литералами).
				Операторы могут быть классифицированы по их функциональности. Вот
				основные типы операторов:
			</p>
			<p>
				<ol>
					<li>Арифметические операторы</li>
					<li>Операторы присваивания</li>
					<li>Логические операторы</li>
					<li>Операторы сравнения</li>
					<li>Побитовые операторы</li>
					<li>Операторы типов</li>
					<li>Тернарный оператор</li>
					<li>Операторы доступа к свойствам объекта</li>
					<li>Операторы управления потоком</li>
				</ol>
			</p>
			<p>
				Каждый из этих операторов выполняет определенные операции или управляет
				потоком выполнения программы в JavaScript.
			</p>
		</div>
	)
}

export default Question
