import React from 'react'

const Question_1 = () => {
	return (
		<div>
			<p>
				Свойство <b>valueAsNumber</b> является частью интерфейса элементов формы
				в JavaScript и используется для доступа к числовым значениям,
				представленным в элементе формы.
			</p>
			<p>
				Это свойство преобразует значение элемента формы (обычно связанного с
				числовым вводом, таким как <b>input type="number"</b>) в числовой тип
				данных (<b>number</b>), делая его удобным для выполнения математических
				операций или сравнений в коде JavaScript.
			</p>
		</div>
	)
}

export default Question_1
