import React from 'react'

const Question_1 = () => {
	return (
		<div>
			<p>
				В контексте HTML, валидация - это процесс проверки HTML-кода на
				соответствие стандартам и правилам языка. HTML-валидация позволяет
				убедиться, что веб-страницы написаны правильно и согласно спецификации
				HTML. Если страница проходит валидацию, это означает, что она не
				содержит синтаксических ошибок и соответствует правилам HTML, что
				способствует правильному отображению и интерпретации содержимого
				различными браузерами и другими инструментами.
			</p>
			<p>Этапы, типы или аспекты:</p>
			<ol>
				<li>
					<b>Синтаксическая проверка (Syntax Validation)</b>
				</li>
				<li>
					<b>Структурная проверка (Structural Validation)</b>
				</li>
				<li>
					<b>Проверка на доступность (Accessibility Validation)</b>
				</li>
				<li>
					<b>Проверка на кроссбраузерность (Cross-Browser Validation)</b>
				</li>
			</ol>
			<p>
				Для проверки валидности HTML-кода можно использовать онлайн-инструменты
				или локальные валидаторы, такие как W3C Markup Validation Service,
				который предоставляет возможность проверки на соответствие стандартам
				W3C.
			</p>
		</div>
	)
}

export default Question_1
