import React from 'react'

const Question = () => {
	return (
		<div>
			<p>
				Прогрессивное веб-приложение (Progressive Web Application, PWA) - это
				тип веб-приложения, которое объединяет преимущества веб-сайта и
				мобильного приложения, предоставляя пользователю современный и
				отзывчивый пользовательский опыт. PWA созданы с использованием
				веб-технологий, но имеют возможности, которые обычно ассоциируются с
				нативными приложениями.
			</p>
			<p>Основные характеристики PWA:</p>
			<p>
				<ol>
					<li>
						<b>Прогрессивность: </b>PWA обеспечивает прогрессивное улучшение,
						что означает, что они могут работать на любых устройствах и
						браузерах, независимо от их возможностей. Они начинают работу как
						обычные веб-сайты и постепенно предоставляют более функциональные
						возможности при наличии поддержки браузера.
					</li>
					<li>
						<b>Отзывчивый дизайн: </b>PWA автоматически адаптируются под разные
						размеры экранов и устройства, обеспечивая хороший пользовательский
						опыт как на настольных компьютерах, так и на мобильных устройствах.
					</li>
					<li>
						<b>Offline-работа: </b>Одной из ключевых особенностей PWA является
						возможность работать в офлайн-режиме. Они используют кэширование,
						чтобы сохранить ранее загруженный контент, что позволяет
						пользователям продолжать взаимодействовать с приложением даже при
						отсутствии интернета.
					</li>
					<li>
						<b>Быстрая загрузка: </b>PWA загружаются быстро благодаря
						оптимизации ресурсов и использованию сервис-воркеров (Service
						Workers) для кэширования контента и управления сетевыми запросами.
					</li>
					<li>
						<b>Поддержка уведомлений: </b>PWA могут отправлять уведомления на
						устройство пользователя, что делает их более похожими на нативные
						приложения.
					</li>
					<li>
						<b>Установка на главный экран: </b>Пользователи имеют возможность
						добавить PWA на главный экран своего устройства, создавая иллюзию
						нативного приложения.
					</li>
					<li>
						<b>Безопасность: </b>PWA должны использовать протокол HTTPS для
						обеспечения безопасности передачи данных.
					</li>
				</ol>
			</p>
			<p>
				Прогрессивные веб-приложения создаются с использованием веб-технологий,
				таких как HTML, CSS и JavaScript, и могут быть развернуты через
				веб-браузеры, не требуя установки из магазинов приложений. Они
				предоставляют более гибкий способ доставки контента и функциональности
				пользователям, сочетая преимущества веба и мобильных приложений.
			</p>
		</div>
	)
}

export default Question
