import React from 'react'

const Question_1 = () => {
	return (
		<div>
			<p>
				<b>inputmode</b> - это атрибут HTML, который используется для
				определения предпочтительного способа ввода данных в поле ввода. Он
				позволяет указать браузеру, какая клавиатурная раскладка или метод ввода
				следует использовать для конкретного поля ввода.
			</p>
			<p>
				Этот атрибут не влияет на то, как данные будут обрабатываться или
				валидироваться, но предоставляет подсказку браузеру относительно того,
				какая клавиатурная раскладка или метод ввода будет более удобным для
				пользователя.
			</p>
		</div>
	)
}

export default Question_1
