import React from 'react'

const Question = () => {
	return (
		<div>
			<p>
				CSS-препроцессор - это инструмент, который расширяет функциональность
				обычных таблиц стилей (CSS) путем предоставления дополнительных
				возможностей, таких как переменные, вложенность, миксины (mixins),
				операторы и другие конструкции. Эти расширенные функции облегчают и
				ускоряют процесс написания и поддержки стилей веб-приложений.
			</p>
			<p>Некоторые из популярных CSS-препроцессоров включают:</p>
			<p>
				<ul>
					<li>
						<b>Sass (Syntactically Awesome Stylesheets): </b>Sass предоставляет
						более выразительный и гибкий синтаксис CSS, включая переменные,
						вложенные правила, миксины и многое другое. Sass-файлы имеют
						расширение .scss или .sass.
					</li>
					<li>
						<b>Less: </b>Less также предоставляет расширенные возможности для
						CSS, включая переменные, вложенные правила, миксины и другие
						функции. Файлы Less имеют расширение .less.
					</li>
				</ul>
			</p>
		</div>
	)
}

export default Question
