import React from 'react'

const Question = () => {
	return (
		<div>
			<p>
				Скринридер (Screen Reader) - это программное обеспечение, которое
				предназначено для помощи слепым и слабовидящим пользователям в
				использовании компьютеров и интернета. Основная функция скринридера -
				это преобразование текста и другого контента на экране компьютера в
				звуковой формат, который затем озвучивается с помощью синтеза речи. Это
				позволяет пользователям с ограниченными или отсутствующими возможностями
				зрения получать информацию с веб-сайтов, приложений и других
				компьютерных программ.
			</p>
			<p>
				Скринридеры предоставляют слепым и слабовидящим пользователям доступ к
				веб-содержанию, а также к операционным системам, приложениям и другим
				ресурсам. Они могут читать текст на веб-страницах, описывать
				изображения, навигировать по веб-сайтам и помогать в выполнении
				различных задач, таких как отправка электронной почты, просмотр
				документов и многое другое.
			</p>
			<p>
				Скринридеры доступны для разных операционных систем (например, JAWS и
				NVDA для Windows, VoiceOver для macOS, TalkBack для Android) и могут
				быть настроены на индивидуальные потребности пользователей. Важно
				учитывать доступность при разработке веб-сайтов и приложений, чтобы
				обеспечить совместимость с такими технологиями и облегчить использование
				ресурсов для всех пользователей, включая тех, которые полагаются на
				скринридеры.
			</p>
		</div>
	)
}

export default Question
