import React from 'react'

const Question_1 = () => {
	return (
		<div>
			<p>
				Элемент &lt;canvas&gt; в HTML представляет собой область, на которой
				можно рисовать графику, изображения и создавать анимации с помощью
				JavaScript. Он предоставляет разработчикам возможность создавать
				интерактивные и динамические элементы, такие как игры, графики,
				диаграммы и другие визуальные элементы, напрямую в браузере.
			</p>
			<p>
				Элемент &lt;canvas&gt; представляет собой просто контейнер, по сути,
				прямоугольную область на веб-странице, на которой можно рисовать графику
				с использованием различных методов JavaScript. Он не предоставляет
				каких-либо инструментов для рисования по умолчанию, а вместо этого
				позволяет программисту использовать JavaScript для создания графического
				содержимого.
			</p>
		</div>
	)
}

export default Question_1
