import React from 'react'

const Question_1 = () => {
	return (
		<div>
			<p>
				Базовая структура HTML-страницы включает несколько основных элементов,
				которые обеспечивают правильное отображение и семантику веб-документа.
			</p>
			<p>
				<ul>
					<li>
						<b>Атрибуты SVG: </b> SVG элементы могут содержать атрибуты для
						стилизации и форматирования, такие как <b>fill</b>, <b>stroke</b>,{' '}
						<b>stroke-width</b>, <b>opacity</b> и другие.
					</li>
					<li>
						<b>CSS для SVG: </b> SVG можно стилизовать с помощью CSS. Стили
						могут быть применены к SVG элементам так же, как к обычным HTML
						элементам.
					</li>
					<li>
						<b>Встроенные стили в SVG: </b> В SVG можно встраивать стили прямо
						внутрь кода SVG с помощью элемента &lt;style&gt;, позволяя применять
						стили к отдельным элементам SVG.
					</li>
					<li>
						<b>Градиенты и фильтры: </b> SVG поддерживает создание градиентов,
						теней, маскировок и других сложных эффектов, что позволяет создавать
						более сложные и привлекательные визуальные эффекты.
					</li>
					<li>
						<b>JavaScript с SVG: </b> SVG можно манипулировать с помощью
						JavaScript для создания анимаций, интерактивных элементов и
						динамического контента на веб-страницах.
					</li>
				</ul>
			</p>
		</div>
	)
}

export default Question_1
