import React from 'react'

const Question_1 = () => {
	return (
		<div>
			<p>
				HTML (HyperText Markup Language) - это язык разметки, который
				используется для создания и структурирования содержимого веб-страниц. Он
				является основой всех веб-сайтов в Интернете и используется для
				определения структуры и содержания веб-страницы, таких как текст,
				изображения, видео, ссылки и другие элементы.
			</p>

			<p>
				HTML используется для того, чтобы задать структуру страницы и указать
				браузеру, как отображать содержимое. Когда вы посещаете веб-сайт, ваш
				веб-браузер интерпретирует HTML-код и отображает его вам в виде
				веб-страницы согласно заданным правилам и стилям.
			</p>
		</div>
	)
}

export default Question_1
