import React from 'react'

const Question_1 = () => {
	return (
		<div>
			<p>
				Атрибут <b>target</b> используется в HTML для указания, где браузер
				должен открыть ссылку или загрузить содержимое, указанное в атрибуте{' '}
				<b>href</b> (для тегов <b>&lt;a&gt;</b>, <b>&lt;area&gt;</b>, или{' '}
				<b>&lt;form&gt;</b>) или при отправке формы. Он определяет контекст, в
				котором будет открыт URL, который установлен в элементе. Значения
				атрибута <b>target</b> определяют, в каком окне или фрейме будет
				отображаться результат навигации.
			</p>
		</div>
	)
}

export default Question_1
