import React from 'react'

const Question = () => {
	return (
		<div>
			<p>
				<ol>
					<li>
						<b>.push(): </b>Добавляет один или несколько элементов в конец
						массива и возвращает новую длину массива.
					</li>
					<li>
						<b>.pop(): </b>Удаляет последний элемент из массива и возвращает
						его.
					</li>
					<li>
						<b>.shift(): </b>Удаляет первый элемент из массива и возвращает его.
					</li>
					<li>
						<b>.unshift(): </b>Добавляет один или несколько элементов в начало
						массива и возвращает новую длину массива.
					</li>
				</ol>
			</p>
		</div>
	)
}

export default Question
